-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-08-09 09:23:46
-- 伺服器版本： 10.4.24-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `comment0824`
--

-- --------------------------------------------------------

--
-- 資料表結構 `comment`
--

CREATE TABLE `comment` (
  `comment_sid` int(11) NOT NULL,
  `account` varchar(255) NOT NULL,
  `nickname` varchar(255) NOT NULL,
  `comment` varchar(255) DEFAULT NULL,
  `avatar` varchar(255) DEFAULT NULL,
  `images` varchar(255) DEFAULT NULL,
  `rating` varchar(255) NOT NULL,
  `likes` varchar(1000) NOT NULL,
  `created_at` datetime NOT NULL,
  `product_sid` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `comment`
--

INSERT INTO `comment` (`comment_sid`, `account`, `nickname`, `comment`, `avatar`, `images`, `rating`, `likes`, `created_at`, `product_sid`) VALUES
(1, 'farmer0001', '王小白', '超愛小鱻肉推薦的生鮮食品，都會自己先吃過才會推薦給朋友。 ', NULL, NULL, '5', '10', '2022-05-14 14:30:30', '30'),
(2, 'farmer0002', '王小紅', '商品很新鮮', NULL, NULL, '5', '10', '2022-05-15 14:30:30', '30'),
(3, 'farmer0003', '方小黑', '嚴選生鮮食材 選擇多樣 讓人忍不住 餐餐想自己動手煮 ', NULL, NULL, '5', '10', '2022-05-16 14:30:30', '30'),
(4, 'farmer0004', '李小黑', '新鮮的食材，很棒 東西都很好吃 會常常來光顧 ', NULL, NULL, '4', '10', '2022-05-17 14:30:30', '30'),
(5, 'farmer0005', '郭小藍', '商品很新鮮', NULL, NULL, '3', '10', '2022-05-18 14:30:30', '30'),
(6, 'farmer0006', '方大同', '這家鮭魚很好吃又新鮮，推薦大家來這邊選購', NULL, NULL, '5', '10', '2022-05-19 14:30:30', '30'),
(7, 'farmer0007', '王小白', ':( BAD', NULL, NULL, '1', '10', '2022-05-20 14:30:30', '30'),
(8, 'farmer0008', '王小白', '新鮮，價格實惠，值得常常來挖寶 ', NULL, NULL, '4', '10', '2022-05-21 14:30:30', '30'),
(9, 'farmer0009', '王小白', '東西齊全價格便宜，服務親切，值得推薦 ', NULL, NULL, '5', '10', '2022-05-22 14:30:30', '30'),
(10, 'farmer0010', '王小白', '食材新鮮 ', NULL, NULL, '3.5', '10', '2022-05-23 14:30:30', '30'),
(11, 'farmer0011', '王小白', 'GOOD', NULL, NULL, '4', '11', '2022-05-23 14:30:31', '30'),
(12, 'farmer0015', '郭大黑', 'GOOD', NULL, NULL, '4', '15', '2022-05-23 14:30:35', '30'),
(13, 'farmer0016', '王小白', 'GOOD', NULL, NULL, '4', '16', '2022-05-23 14:30:36', '30'),
(14, 'farmer0017', '王小白', '什麼都有什麼都賣 買鮮魚買水果買牛排這裡通通有 很方便', NULL, NULL, '5', '17', '2022-05-23 14:30:37', '6'),
(15, 'farmer0018', '王小白', '蘋果很甜', NULL, NULL, '5', '18', '2022-05-23 14:30:38', '6'),
(16, 'farmer0019', '郭小藍', '服務好 商品好吃 ', NULL, NULL, '5', '19', '2022-05-23 14:30:39', '6'),
(17, 'farmer0020', '王小白', '商品很新鮮', NULL, NULL, '5', '20', '2022-05-23 14:30:40', '6'),
(18, 'farmer0021', '王小白', 'CP值高 ', NULL, NULL, '4', '21', '2022-05-23 14:30:41', '6'),
(19, 'farmer0022', '王小白', '想說隨便找一間訂購買買，結果還不錯...', NULL, NULL, '4', '22', '2022-05-23 14:30:42', '6'),
(20, 'farmer0025', '王小白', '送來的的蔬菜及瓜果類都非常新鮮，品質優於大賣場及傳統市場，重點疫情期間內，幫忙送到府減少接觸，真是佛心，更別提大熱天的，送貨司機也超貼心的，辛苦了！ ', NULL, NULL, '2', '25', '2022-05-23 14:30:45', '6'),
(21, 'farmer0026', '王小白', '非常實在！價格合理，服務周到！ ', NULL, NULL, '2', '26', '2022-05-23 14:30:46', '6'),
(22, 'farmer0027', '王小白', 'GOOD', NULL, NULL, '2', '27', '2022-05-23 14:30:47', '6'),
(23, 'farmer0028', '王小白', '送來都爛掉，傻眼', NULL, NULL, '1', '28', '2022-05-23 14:30:48', '6'),
(24, 'farmer0029', '王小白', '香蕉很好吃', NULL, NULL, '5', '29', '2022-05-23 14:30:49', '7'),
(25, 'farmer0030', '王小白', 'CP值高 ', NULL, NULL, '5', '30', '2022-05-23 14:30:50', '7'),
(26, 'farmer0031', '王小白', '極力推薦優良商家 各種生鮮蔬果 品質超好的，蔬菜水果清洗過後就可以吃了，根本不用再挑選不良品，絕對是超值。 ', NULL, NULL, '5', '31', '2022-05-23 14:30:51', '7'),
(27, 'farmer0032', '王小白', '', NULL, NULL, '3', '32', '2022-05-23 14:30:52', '7'),
(28, 'farmer0033', '王小白', '', NULL, NULL, '3', '33', '2022-05-23 14:30:53', '7'),
(29, 'farmer0034', '王小白', '', NULL, NULL, '3', '34', '2022-05-23 14:30:54', '7'),
(30, 'farmer0035', '王小白', '', NULL, NULL, '2', '35', '2022-05-23 14:30:55', '7'),
(31, 'farmer0036', '王小白', '', NULL, NULL, '2', '36', '2022-05-23 14:30:56', '7'),
(32, 'farmer0037', '王小白', '', NULL, NULL, '2', '37', '2022-05-23 14:30:57', '7'),
(33, 'farmer0038', '王小白', '司機態度不好...打電話也沒人接 :(', NULL, NULL, '1', '38', '2022-05-23 14:30:58', '7'),
(34, 'farmer0039', '王小白', '蔬果很新鮮，司機都很親切，遇到問題也會處理好，不錯！ ', NULL, NULL, '5', '39', '2022-05-23 14:30:59', '15'),
(35, 'farmer0040', '王小白', '服務態度不錯，生鮮蔬果都很新鮮 ', NULL, NULL, '5', '40', '0000-00-00 00:00:00', '15'),
(36, 'farmer0041', '王小白', '商品很新鮮', NULL, NULL, '3', '41', '0000-00-00 00:00:00', '15'),
(37, 'farmer0042', '王小白', '還行', NULL, NULL, '3', '42', '0000-00-00 00:00:00', '15'),
(38, 'farmer0043', '王小白', 'good~', NULL, NULL, '3', '43', '0000-00-00 00:00:00', '15'),
(39, 'farmer0044', '王小白', 'good~\\', NULL, NULL, '5', '44', '0000-00-00 00:00:00', '15'),
(40, 'farmer0045', '王小白', '還可以再更好', NULL, NULL, '3', '45', '0000-00-00 00:00:00', '15'),
(41, 'farmer0046', '王小白', '價格便宜，服務親切，值得推薦 ', NULL, NULL, '5', '46', '0000-00-00 00:00:00', '33'),
(42, 'farmer0047', '郭小藍', '肉超好吃的', NULL, NULL, '4', '47', '0000-00-00 00:00:00', '33'),
(43, 'farmer0048', '王小白', 'CP值高 ', NULL, NULL, '4', '48', '0000-00-00 00:00:00', '33'),
(44, 'farmer0049', '王小白', '好讚', NULL, NULL, '4', '49', '0000-00-00 00:00:00', '33'),
(45, 'farmer0050', '王小白', '肉類很新鮮很好吃', NULL, NULL, '4', '50', '0000-00-00 00:00:00', '33'),
(46, 'farmer0051', '王小白', '好吃!!!!!!', NULL, NULL, '5', '51', '0000-00-00 00:00:00', '33'),
(47, 'farmer0052', '郭小藍', '', NULL, NULL, '5', '52', '0000-00-00 00:00:00', '33'),
(48, 'farmer0053', '王小白', '', NULL, NULL, '5', '53', '0000-00-00 00:00:00', '33'),
(49, 'farmer0054', '王小白', '還可以', NULL, NULL, '3', '54', '0000-00-00 00:00:00', '33'),
(50, 'farmer0055', '王小白', '', NULL, NULL, '5', '55', '0000-00-00 00:00:00', '33'),
(51, 'farmer0056', '郭小藍', '非常棒 ', NULL, NULL, '5', '1', '2021-01-02 23:56:11', '33'),
(52, 'farmer0057', '王小白', '不錯~', NULL, NULL, '3', '60', '2022-02-02 11:30:30', '5'),
(53, 'farmer0058', '郭小藍', '新鮮', NULL, NULL, '5', '3', '2022-05-02 14:30:30', '5');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`comment_sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `comment`
--
ALTER TABLE `comment`
  MODIFY `comment_sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
