-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-07-29 16:12:54
-- 伺服器版本： 10.4.24-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `farmer26`
--

-- --------------------------------------------------------

--
-- 資料表結構 `recipe`
--

CREATE TABLE `recipe` (
  `recipes_sid` int(11) NOT NULL,
  `recipes_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `recipes_time_cost` int(11) NOT NULL,
  `recipes_portion` int(11) NOT NULL,
  `recipes_calories` varchar(11) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `recipes_type` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `recipes_cooking_degree` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `recipes_ingredient` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `recipes_cooking_method` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `recipes_description` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `recipes_img` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `cooking_create_member_Id` int(20) NOT NULL,
  `recipes_like` int(11) NOT NULL,
  `recipes_collection` int(11) NOT NULL,
  `created_at` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `recipe`
--

INSERT INTO `recipe` (`recipes_sid`, `recipes_name`, `recipes_time_cost`, `recipes_portion`, `recipes_calories`, `recipes_type`, `recipes_cooking_degree`, `recipes_ingredient`, `recipes_cooking_method`, `recipes_description`, `recipes_img`, `cooking_create_member_Id`, `recipes_like`, `recipes_collection`, `created_at`) VALUES
(1, '櫛瓜骰子牛', 15, 3, '400', '台式料理', '簡單', '櫛瓜一條\r\n骰子牛一包\r\n蒜頭3-4粒\r\n鹽適量\r\n黑胡椒適量\r\n自製豬油或橄欖油適量', '1.準備一條櫛瓜，和一包骰子牛\r\n2.櫛瓜切片\r\n3.兩面煎焦黃，撒點鹽和黑胡椒調味，起鍋備用\r\n4.原鍋子煎蒜頭和骰子牛\r\n5.最後把櫛瓜加進來翻炒後起鍋', '減脂也要美味，美味也要減脂', 'f7c081cb10d82c37fcf66cd296c2c52f.jpg', 123456, 19, 30, '2022-06-01'),
(2, '破布子蒸魚', 20, 4, '500', '台式料理', '簡單', '比目魚切片  1片(約260公克)\r\n米酒  1又1/2大匙\r\n鹽  少許\r\n蔥  二支\r\n薑  25公克\r\n紅辣椒  1~1/2條\r\n破布子(含汁)  2大匙\r\n醬油  1小匙\r\n白胡椒粉  1/8小匙\r\n香油  1/2小匙', '1.準備食材。蔥洗淨分成蔥段和蔥絲。薑，去皮切成絲。紅辣椒，切成絲。\r\n2.比目魚切片洗淨，塗抹少許鹽在魚身上，並淋上米酒。\r\n3.調製淋醬，將破布子含汁、醬油、香油、白胡椒粉，到入拌勻。\r\n4.圓盤底先放上蔥段，再放上比目魚切片，放上薑絲，淋上醬汁。\r\n5.電鍋外鍋先預放水蒸熱，待電鍋水蒸氣冒煙時，再將魚放入電鍋內蒸，約蒸15分鐘。\r\n6.蒸好時，再放入蔥絲、紅辣椒絲，回蒸一下子(約1分鐘)即可。', '破布子蒸魚，使用電鍋即可輕鬆完成，零廚藝美味料理。', 'ca7b8438864a56726c10d30bd91a578e.jpg', 123456, 27, 19, '2022-06-01'),
(3, '味噌烤鯖魚', 15, 4, '300', '日式料理', '新手輕鬆入門', '半邊鯖魚 2片\r\n味噌 2 湯匙\r\n日式料理酒 2 湯匙\r\n味醂 2 湯匙\r\n日本醬油 1/2 茶匙\r\n糖 2 茶匙', '1.把鯖魚洗淨印乾後，每塊切成3份\r\n2.把味噌、日式料理酒、味醂、日本醬油和糖拌勻成醬汁。\r\n3.把鯖魚和醬汁放入食物袋中，讓鯖魚都沾到醬汁，放入冰箱(4℃)醃2小時以上。\r\n4.在烤盤上鋪上鋁箔紙並放上網架，在網架上抹油。把鯖魚放在網架上，把一些餘下的醬汁掃在鯖魚上。\r\n5.放入己預熱至200℃的烤箱中層烤5分鐘。\r\n6.取出鯖魚，再把一些餘下的醬汁掃在鯖魚上，放回烤箱中多烤5分鐘即成。', '冷凍鯖魚便宜又方便，除了做鹽燒鯖魚或照燒鯖魚，可以試試做這個金黃色的味噌鯖魚，好看又好吃！', 'bccb8a1828f502a9a3d7dc3d605251b9.jpg', 123456, 33, 29, '2022-06-01'),
(4, '金沙蒜醬焗烤明蝦 (澎湖野生大明蝦)', 20, 4, '600', '台式料理', '新手輕鬆入門', '澎湖野生大明蝦  4隻\r\n焗烤起司絲  10g\r\n金沙蒜醬\r\n鹹蛋黃  3顆\r\n米酒  2匙\r\n大蒜  2瓣\r\n美乃滋  2匙\r\n檸檬汁  1匙', '1.料理前，將明蝦以流水沖5分鐘即可退冰，更能完整保持野生大明蝦Q彈鮮脆的肉質\r\n2.退冰後的澎湖野生大明蝦，取一把剪刀，從蝦頭和蝦身的間隙，剪開蝦背。\r\n3.將腸泥取出丟掉，大明蝦就處理完成。\r\n4.準備鹹蛋黃、美乃滋、蒜末、檸檬汁。\r\n5.將米酒淋在鹹蛋黃上，稍微浸泡1分鐘。因為生的鹹蛋黃味道較腥，用米酒浸泡一下，可以去除腥味。\r\n6.泡好的鹹蛋黃，瀝乾後，置於烤盤，放入烤箱，用150°C烤15分鐘。\r\n7.用叉子將鹹蛋黃壓碎，壓成顆粒細緻的狀態即可。\r\n8.將美乃滋、蒜末、檸檬汁，加入壓碎的鹹蛋黃中', '來自水質清澈的沙質海底，「澎湖野生大明蝦」肉質Q彈鮮脆，而且非常鮮甜，隻隻肥美、蝦膏濃郁，是老饕的最愛。\r\n搭配鹹蛋黃做成的金沙蒜醬，只要焗烤一下，口味香濃的宵夜立即上桌。', '0f06264e9e2497a0449ac3dbdcf68533.jpg', 123456, 39, 22, '2022-06-01'),
(5, '水牛城辣雞翅', 30, 10, '600', '西式料理', '餐廳廚師料理', '雞二節翅 20支\r\n地瓜粉 兩大匙\r\n大蒜粉 一大匙\r\n黑胡椒 1匙\r\n白胡椒 1匙\r\n鹽 2/1匙\r\n紅椒粉 一大匙（可調整）\r\n泰國是拉差辣醬 大量\r\n奶油 30克\r\n蜂蜜 兩大匙\r\n檸檬汁 半顆\r\n洋蔥末 8/1顆\r\nTabasco 適量（可調整）', '1.料理前，將明蝦以流水沖5分鐘即可退冰，更能完整保持野生大明蝦Q彈鮮1.食材準備好後，將雞翅裝入碗或塑膠袋中，倒入食材頁面所打的調味料比例開始拌勻\r\n2.調味料拌勻後，靜置約10分鐘，烤箱先調200度預熱準備\r\n3.烤箱熱後雞翅放入烤20分鐘\r\n4.準備辣醬汁材料，洋蔥切成末預備\r\n5.將平底鍋預熱加入奶油，融化後再加泰國是拉差辣醬、蜂蜜、檸檬汁、洋蔥末，小火攪拌煮至稠狀關火預備(愛吃辣的朋友可加入適量Tabasco調味)\r\n6.將烤好雞翅取出放入辣醬中，開小火小心拌炒，盡量讓每支雞翅都能吸收辣醬\r\n7', '在美國紅到有特定節日的料理，用烤箱及鍋子即可完成', '5fae45ceb8a9db0f9f77d8b77856f8c2.jpg', 123456, 13, 8, '2022-06-01'),
(6, '蕃茄肉捲', 10, 4, '500', '台式料理', '新手輕鬆入門', '1.豬五花火鍋肉片12片\r\n2.小蕃茄12個\r\n3.鹽適量\r\n4.黑胡椒適量', '1.豬五花肉片攤平後把小蕃茄捲起\r\n2.再用竹籤串並固定，放進烤箱用200度烤10至15分即完成', '適合中秋節烤肉的料理', 'de83857d411770e5527cd1e85ec7b73b.jpg', 123456, 18, 25, '2022-06-01'),
(7, '蔥香肉排', 15, 5, '400', '台式料理', '新手輕鬆入門', '豬絞肉（細）  350克\r\n蔥末  30克\r\n醬油  1大匙\r\n干貝風味調味粉  2克\r\n白胡椒粉  適量\r\n太白粉  1大匙\r\n香油  4、5滴', '1.將所有材料混合抓勻。（胡椒粉多一些，香氣更濃郁）\r\n2.平底不沾鍋放入適量油，先大火熱鍋約1分半鐘，轉小火。熱鍋的時候，將混拌均勻的絞肉抓取一坨，先在手上擠成一丸，用手壓扁些（如照片），等熱鍋完成就放入平底鍋。\r\n3.煎熟即可上桌', '肉排多汁且混合蔥香、胡椒香，風味迷人。', '2e918083242e60250e5cdf7577bd2a45.jpg', 123456, 30, 24, '2022-06-01'),
(8, '醬燒豆包', 15, 3, '500', '台式料理', '餐廳廚師料理', '1.豆包  6片\r\n2.素蠔油  2大匙\r\n3.蕃茄醬  1大匙\r\n4.烏醋  1/2大匙\r\n5.白胡椒粉  1小匙\r\n6.熱開水  1/3碗\r\n7.蔥花  3大匙\r\n8.辣椒(配色用，可略)  少許', '1.豆包對切，入油鍋，以中火煎至二面略呈酥皮狀。\r\n2.所有調味料拌勻\r\n3.爐火轉中小火，將醬汁酌量(約1/3)倒入步驟1當中，使豆包二面均勻沾裹醬汁後盛盤。\r\n4.原鍋續倒入剩餘的醬汁、蔥花及辣椒(可略)，以小火煮滾。\r\n5.在盛盤的豆包淋上蔥花醬汁，料理完成。', '常見的家常菜，食材易取得，容易料理', 'f10727d349096eb6c58b8257138e3733.jpg', 123456, 25, 36, '2022-06-01'),
(9, '韓式辣味豆芽菜', 20, 3, '200', '韓式料理', '簡單新手輕鬆入門', '黃豆芽一包\r\n調味料\r\n1.鹽巴適量\r\n2.蒜泥適量\r\n3.醬油適量\r\n4.辣椒粉適量\r\n5.蔥花適量', '1.先煮一鍋滾水，放入少許鹽與黃豆芽，蓋上鍋蓋中火煮約3分鐘。\r\n2.煮好後撈起立刻沖水，讓黃豆芽口感較清脆。\r\n3.取一保鮮盒，放入蒜泥、醬油、鹽、白芝麻油或辣椒粉，一起攪拌均勻，最後灑一點蔥花點綴，即完成。', '涼拌製作的韓式料理，使用蔬菜、調味與辛香料', '1a4805637aa3dc71a75ca73c564e6d5c.jpg', 123456, 31, 30, '2022-06-01'),
(10, '雞胸酪梨卷', 20, 3, '600', '台式料理', '新手輕鬆入門', '1.雞胸肉(去皮)150g\r\n2.酪梨1/4個\r\n3.大杏鮑菇1/2根\r\n4.蒜頭1瓣\r\n5.起士片1片\r\n調味料\r\n1.白醋1大匙\r\n2.蜂蜜1大匙\r\n3.醬油1小匙\r\n4.鹽適量\r\n5.黑胡椒適量', '1.熱平底鍋倒入少許油，先煎肉卷接合面，熟後翻面，煎至整個肉卷均成金黃色，取出切塊備用。\r\n2.平底鍋開小火，倒入白醋、醬油、蜂蜜攪拌均勻，完成醬汁，淋上肉卷即可盛盤。', '適合夏天的西式料理，相當爽口', '3890202e8e05abeecd81b6c5ce50857c.jpg', 123456, 20, 35, '2022-06-01'),
(11, '台式打拋豬', 10, 3, '600', '台式料理', '新手輕鬆入門', '1.豬絞肉  150克\r\n2.杏鮑菇  2小條\r\n3.綠櫛瓜  1/3條\r\n4.九層塔  半包\r\n5.鹽巴或雞粉  適量\r\n6.小辣椒  1條（非必要）', '1.九層塔洗淨，粗梗摘除。杏鮑菇與櫛瓜切成大小差不多的方塊狀，辣椒切小段備用。\r\n2.熱過後加油，放入絞肉炒至半熟。\r\n3.加入櫛瓜/杏鮑菇塊，拌炒至熟。\r\n4.加入調味料後，加九層塔葉拌炒，香味出來就差不多可以了。須注意不需要炒太久，保持九層塔葉漂亮的綠色。', '打拋豬是一道非常下飯的料理，減醣的時候少吃精緻澱粉，直接吃也不會過鹹，非常清爽', '33e408ef1e154e615600395ca2ea1182.jpg', 123456, 45, 37, '2022-06-01'),
(12, '涼拌金針菇', 10, 4, '200', '台式料理', '新手輕鬆入門', '金針菇  200g\r\n紅蘿蔔  40g\r\n小黃瓜  70g\r\n蒜頭  3瓣\r\n青蔥  1/2根\r\n香油  1大匙\r\n鹽  1/5茶匙\r\n糖  1/8茶匙\r\n醬油  1大匙\r\n白胡椒粉  少許\r\n烏醋  1.25大匙', '1.紅蘿蔔、小黃瓜切絲；蒜頭切末；青蔥切蔥花；金針菇去根部撥散備用。\r\n2.將小黃瓜絲以1/4茶匙的鹽抓醃，去青出水。\r\n3.起一鍋沸水，放入金針菇煮2分鐘，再放入紅蘿蔔汆燙30秒，取出瀝乾水份，倒入調理盆。\r\n4.另取鍋，倒入香油，中火爆香蒜末及蔥白。\r\n5.將步驟4倒入步驟3，撒上蔥花及小黃瓜絲。\r\n6.加入鹽、糖、白胡椒粉及醬油拌勻，最後再加入烏醋提味即可。', '做法快速又簡單，絕對是零失敗料理', '3438af3529e58685c40e56e33cca6519.jpg', 123456, 15, 22, '2022-06-01'),
(13, '杏鮑菇炒空心菜', 10, 3, '300', '台式料理', '新手輕鬆入門', '1.空心菜  1大把\r\n2.杏鮑菇  3根\r\n3.鹽巴  適量\r\n4.油  適量', '1.備料，杏鮑菇切塊，切空心菜。\r\n2.油下，先炒杏鮑菇。\r\n3.鍋蓋蓋上悶杏鮑菇，火別太大，等菇慢慢出水。\r\n4.出來的水可以炒菜。加鹽調味，完成。', '快速簡單。夏天的葉菜種類較少，用菇類做點變化。', 'db494ecec400f7d582d0962c3fa46607.jpg', 123456, 12, 13, '2022-06-01'),
(14, '麻油肉燥燙地瓜葉', 5, 4, '300', '台式料理', '新手輕鬆入門', '1.地瓜葉  半包\r\n2.麻油  1小匙\r\n3.肉燥料理包  1包', '1.清洗乾淨後挑葉子，葉梗去硬皮。地瓜葉富含鐵質，遇到空氣易變黑，挑菜時可以戴著手套。\r\n2.切地瓜葉每段5公分，葉梗、葉子分開放。\r\n3.鍋子水滾加點油防葉子變黑先放葉梗悶煮，再放青菜約2分鐘。\r\n4.起鍋加少許麻油及泡麵沒用的肉燥料理包，就可以輕鬆上菜。', '地瓜葉又稱蕃薯葉，清燙再加上靈魂醬汁，就是道完美的家常菜', 't48d6f946c292a72ec440dbc4422fa5d.jpg', 123456, 32, 11, '2022-06-01'),
(15, '蛋香高麗菜鮮蝦湯麵', 20, 3, '500', '台式料理', '新手輕鬆入門', '1.冷凍大蝦子  依個人喜愛\r\n2.鮮肉貢丸  依個人喜愛\r\n3.高麗菜  1/6顆\r\n4.雞蛋  2顆\r\n5.青蔥  1支\r\n6.刀削麵  2片\r\n7.鹽巴  依個人喜愛\r\n8.味精  依個人喜愛', '1.蝦子不需退冰、高麗菜洗好撥小塊、青蔥切段、雞蛋打散\r\n2.熱鍋下油把蛋煎熟，稍微焦焦的更香，接著放入青蔥稍微拌炒。加入約1000cc開水，放入貢丸等水滾\r\n3.水開始滾後放入高麗菜，把高麗菜煮軟\r\n4.接著放入麵條\r\n5.麵條微軟之後放入蝦子並調味\r\n6.等蝦子煮熟就可以起鍋', '適合冬天喝下，暖胃的熱湯', '75e15d6f8727399802b1392c400b99b2.jpg', 123456, 41, 32, '2022-06-01'),
(16, '櫻花蝦油飯', 10, 3, '500', '台式料理', '新手輕鬆入門', '1.糯米  3杯\r\n2.肉絲  適量\r\n3.香菇(泡水0.4杯)  4朵\r\n4.櫻花蝦  適量\r\n5.紅蔥頭  適量\r\n6.醬油  2匙\r\n7.蠔油  2匙\r\n8.鹽  1匙\r\n9.太白粉  1匙\r\n10水  40cc\r\n11.白胡椒  適量', '1.油2大匙、紅蔥頭、櫻花蝦5匙，炒香\r\n2.加香菇絲、鹽2匙，炒半軟\r\n3.加肉絲，拌炒變色，熄火備用\r\n4.糯米3杯、香菇水、水2杯、炒料，選擇糯米，開始炊飯', '糯米搭配香菇與蝦米的飯食料理', 'e4fa1e2b21e2a9ee98a9ccb1b8e1fefe.jpg', 123456, 16, 22, '2022-06-01'),
(17, '煎蛋湯', 10, 5, '500', '台式料理', '新手輕鬆入門', '1.雞蛋（土雞蛋最香）  5顆\r\n2.蔥（切蔥花）  2支\r\n3.鹽巴或雞粉  適量\r\n4.白胡椒  少許', '1.起油鍋，熱油（油要比平常再多一些些），油要夠蛋才會香\r\n2.兩面煎金黃，油冒泡泡\r\n3.加水約900ml，煮到沸騰，再用鍋鏟把蛋切開，繼續煮到湯變白\r\n4.調味，最後下蔥花和白胡椒\r\n5.喜歡吃麵可以加麵，喜歡吃飯可以湯拌飯。', '蛋花湯的變化，顛覆大眾對蛋花湯的印象', 'b161f75f968c10be8f35001b502d14c0.jpg', 123456, 26, 10, '2022-06-01'),
(18, '紙包檸檬鮭魚菲力(氣炸鍋版)', 20, 5, '600', '日式料理', '新手輕鬆入門', '1.鮭魚菲力  250g\r\n2.無鹽奶油  10g\r\n3.檸檬  半顆\r\n4.四季豆(甜椒、花椰菜、玉米筍)  適量\r\n5.胡椒鹽  2茶匙\r\n6.蒜頭  4~6瓣', '1.鮭魚菲力沖洗乾淨，輕輕擦乾\r\n2.將鮭魚放在烘焙紙上，塗抹胡椒鹽、擠上檸檬汁，放入奶油及四季豆(依個人喜好四季豆可替換為其他時蔬)，鋪上檸檬片\r\n3.將烘焙紙像糖果一樣包起來，兩邊扭結，氣炸鍋溫度180度，時間20分鐘(依鮭魚菲力大小調整時間，本次使用鮭魚較厚，時間有烤比較久)\r\n4.烤完即可食用', '零失敗食譜，在家也能完成西餐廳料理', 'b0fd632a003a439d13eef6fef4027a0a.jpg', 123456, 54, 47, '2022-06-01'),
(19, '照燒油豆腐', 20, 4, '400', '台式料理', '新手輕鬆入門', '1.油豆腐  1盒\r\n2.蔥  2-3根\r\n3.醬油  1匙\r\n4.米酒  少許\r\n5.砂糖  少許', '1.下少許油煎油豆腐至兩面金黃，再加入蔥白段炒香。\r\n2.再加入醬油、米酒、砂糖煮至兩面入味，醬汁收乾，即可上桌。', '食材容易取得，簡單製作的家常料理', 'c69f681687ed7a38177b1495fc79fe7c.jpg', 123456, 61, 55, '2022-06-01'),
(20, '魚香茄子', 10, 2, '300', '台式料理', '新手輕鬆入門', '1.茄子  兩條\r\n2.豬絞肉  約100克\r\n3.米酒  適量\r\n4.蒜末  適量\r\n5.大辣椒碎  半支\r\n6.醬油  一大匙\r\n7.糖  一茶匙\r\n8.水  約半碗\r\n9.九層塔  適量', '1.茄子切等長、辣椒蒜頭切末備用\r\n2.開中大火加油熱鍋，倒入豬絞肉翻炒，大致熟透後加入適量米酒去腥\r\n3.加入蒜末炒香、辣椒碎(怕辣的話可以最後再加)與茄子拌炒均勻\r\n4.茄子都吃到油後，加入醬油炒出醬香，再加入一小匙糖\r\n5.拌炒均勻後加入約半碗水煨煮\r\n6.收汁收的差不多的時候加入九層塔拌炒\r\n7.下飯的魚香茄子就完成', '好吃的茄子料理，食材容易取得', '30269561b4750bc5bcb5bbbf2a05e12c.jpg', 123456, 83, 68, '2022-06-01'),
(21, '虱目魚肚粥', 20, 1, '500', '台式料理', '新手輕鬆入門', '1.虱目魚肚  2塊\r\n2.白飯  1.5碗\r\n3.蛤蜊  200克\r\n4.蒜末  10克\r\n5.紅蔥頭  10克\r\n6.薑絲  10克\r\n7.芹菜末  適量\r\n8.蒜酥  適量\r\n9.高湯或水  1000毫升\r\n10.鹽  適量\r\n11.胡椒粉  1匙\r\n12.米酒  1匙', '1、虱目魚肚洗淨，擦乾水分，少許油2面各煎30秒撈出備用。\r\n2、放入蒜末、紅蔥頭、薑絲炒香，加入高湯或水，放入米飯，煮至喜愛的口感。\r\n3、放入蛤蜊煮開，加米酒、胡椒粉增添鮮味，試味道後，鹽巴調味。\r\n4、再放入魚肚煮3分鐘即可，食用前，撒點芹菜、蒜酥增添風味即可上桌。', '所謂台南人的早餐～虱目魚肚粥', '6a1fe9731f8707ff07a0943d8aed637b.jpg', 123456, 45, 51, '2022-06-01'),
(22, '紅酒馬鈴薯燉肉', 120, 3, '500', '日式料理', '餐廳廚師料理', '1.豬岬心  300g\r\n2.馬鈴薯  2顆\r\n3.薑  3片\r\n4.紅酒  60-100g\r\n5.日式風味醬油  40g\r\n6.冰糖  30g\r\n7.紅蘿蔔  1根\r\n8.洋蔥  1/4', '1.豬岬心切塊\r\n2.豬肉熱水汆燙 把薑三片一起丟進去去腥\r\n3.汆燙完 進燉鍋 稍微煎一下\r\n4.加水到淹過食材\r\n5.邊滾邊加入食材，先投入紅酒 日式風味醬油、冰糖，再投入馬鈴薯 紅蘿蔔 洋蔥，燉到收汁即可', '風味獨特的西式料理，加白靈菇、鴻喜菇也不錯', 'eb8462298c2bbeffaac86db7833517d0.jpg', 123456, 56, 39, '2022-06-01'),
(23, '左宗棠雞', 25, 4, '500', '中式料理', '餐廳廚師料理', '1.去骨雞腿排  500g\r\n2.大辣椒  3條\r\n3.食用油 (耐高溫)  120ml\r\n4.醬油  2.5大匙\r\n5.雞蛋  1顆\r\n6.太白粉  1.5大匙\r\n7.油  1茶匙\r\n8.蕃茄醬  1大匙\r\n9.蒜頭  3瓣\r\n10.細砂糖  1大匙\r\n11.白醋  1大匙\r\n12.料理米酒  1大匙\r\n13.太白粉  1/2茶匙\r\n14.水  1大匙\r\n15.白胡椒粉  少許', '1.去骨雞腿先劃刀 (加速雞肉熟成及入味速度)再切成適口大小，辣椒切段(不嗜辣者可去籽)；蒜頭切末；蔥切絲後泡水擺盤用。\r\n2.雞肉與醃料拌勻醃15分鐘（下鍋前再依序抓太白粉和油）。加入油可讓雞肉下鍋油炸時，肉較不易黏在一團。\r\n3.將蒜末與調好之醬汁拌勻備用。\r\n4.鍋內倒入120ml的油，將步驟1的雞肉以中火半煎炸的方式煎至表面呈金黃色後先起鍋備用。(二面各約2分鐘左右) 若使用傳統油炸方式，雞肉表面會更加香酥 (油炸可用160度炸至表面金黃)\r\n5.鍋內留下一大匙的油，小火爆香辣椒，放入步驟4的雞肉', '歸類於中國菜系中的湘菜，卻不被湖南人認同。多見於美國與加拿大的中餐館。', '1ed4a6dbd27be33a03c874fe5d51b6cd.jpg', 123456, 21, 29, '2022-06-01'),
(24, '日式蔥燒雞', 15, 2, '600', '台式料理', '新手輕鬆入門', '1.雞腿肉  2塊\r\n2.蔥  1大把\r\n3.鹽  1/3小匙\r\n4.黑胡椒  1/3小匙\r\n5.米酒  1 大匙\r\n6.太白粉  2大匙\r\n7.S&B 生蒜泥醬  1小匙\r\n8.砂糖  1大匙\r\n9.味霖  2大匙\r\n10.醬油  2大匙', '1.將肉切成入口大小，以鹽、黑胡椒、米酒醃 10 分鐘，下鍋前再放入太白粉裏勻\r\n2.將所有【醬汁】先放入小碗中拌勻\r\n3.將醃好的肉下鍋煎至金黃！雞皮朝下開始煎，中火一面1分鐘\r\n4.倒入醬汁，蓋上鍋蓋，悶煮約30秒\r\n5.開蓋後後放入蔥稍微拌炒一下\r\n6.收汁後就算完成，如果要做成燴飯就不要煮太久～', '滿滿的蔥香加上鹹甜的醬汁，非常下飯的一道料理！也可以直接做成燴飯', '0d9a2f7c41b04b9e4b35d5bb69979ed1.jpg', 123456, 74, 83, '2022-06-01'),
(25, '步步高升排骨', 20, 3, '400', '台式料理', '新手輕鬆入門', '1.排骨  一斤\r\n2.米酒  一大匙\r\n3.砂糖  二大匙\r\n4.白醋  三大匙\r\n5.醬油  四大匙\r\n6.水  五大匙', '1.首先川燙排骨至肉變白，將水倒掉。\r\n2.依序加入所有調味。蓋鍋蓋轉中火，偶爾攪拌顏色才會均勻。 水滾後轉中小火，慢慢燜乾。\r\n3.醬汁快乾時轉大火，增添排骨的顏色。', '簡單的調味，就能有好吃的排骨。', '802882fb633fbdbac90d6830a59ff6e2.jpg', 123456, 66, 85, '2022-06-01'),
(26, '三杯雞', 20, 4, '600', '台式料理', '新手輕鬆入門', '1.雞肉  適量\r\n2.醬油  一大匙\r\n3.米酒  一大匙\r\n4.太白粉  一大匙\r\n5.麻油  30g\r\n6.醬油  5大匙\r\n7.米酒  5大匙\r\n8.水  4大匙', '1.熱鍋後加入油先把A下去煎熟,取出盤\r\n2.把瀝起來的雞油+薑片炒乾後再加入蒜頭+冰糖小火炒(記得持攪拌後+放入步驟一雞肉炒\r\n3.接著把步驟B材料放入小火收汁後加入辣椒,放入砂鍋內再放入九層塔蓋蓋子,在到一點點米酒在蓋子周圍即可', '簡單容易料理的家常菜，常見於各家庭餐桌', '3f030b6a61d4dea41b126b71d0653bb3.jpg', 123456, 71, 80, '2022-06-01'),
(27, '懶人版墨西哥雞肉捲餅', 10, 1, '600', '西式料理', '新手輕鬆入門', '1.墨西哥餅皮  2張\r\n2.起士片  1片\r\n3.生菜  適量\r\n4.雞肉串  適量\r\n5.荷包蛋  2顆', '1.雞肉串直接用氣炸鍋加熱。\r\n2.用平底鍋加熱墨西哥餅皮、放上半片起士片。\r\n3.接著將生菜以及荷包蛋擺上、最後放上烤好的雞肉串並包起來即可。', '很適合搭配啤酒的墨西哥料理', 'c40d596c1b82739b1da0a38ade00f23c.jpg', 123456, 85, 94, '2022-06-01'),
(28, '蒜香蔥油雞', 30, 2, '500', '台式料理', '新手輕鬆入門', '1.雞腿肉丁  400克\r\n2.蒜片  20克\r\n3.蔥花  200克\r\n4.香油  2大匙\r\n5.醬油  1大匙\r\n6.米酒  1大匙\r\n7.糖  1匙\r\n8.胡椒粉  1匙\r\n9.鹽巴  2小匙', '1.雞腿肉用醬油、米酒、糖、胡椒粉、鹽，醃漬10分鐘\r\n2.放入蒸鍋或電鍋蒸熟\r\n3.用鍋子將香油加熱，再放蒜片炒香，再放入大把蔥花快速拌炒出香氣即可\r\n4.將蔥油淋上雞肉，美味上桌', '蔥是提高免疫力，抗病毒很好的食材，享受美食的同時，順便增強免疫力', '1dfc348ade6572df05a1dcc33ecd9e71.jpg', 123456, 73, 64, '2022-06-01'),
(29, '豆腐鮮蝦大阪燒', 20, 1, '700', '日式料理', '新手輕鬆入門', '1.嫩豆腐  150g\r\n2.雞蛋  1顆\r\n3.柴魚片  2撮\r\n4.鹽  1茶匙\r\n5.烹大師  1小匙\r\n6.高麗菜  200g\r\n7.白蝦  8-10隻\r\n8.橄欖油  1大匙\r\n9.低脂美乃滋  依喜好\r\n10.大阪燒醬  依喜好\r\n11.海苔粉  依喜好\r\n12.柴魚片  依喜好', '1.嫩豆腐用廚房紙巾吸乾水份後 用打蛋器搗碎\r\n2.加入雞蛋、鹽、烹大師和捏碎的柴魚片 攪拌均勻\r\n3.將高麗菜切成1*1公分的小塊\r\n4.把高麗菜和已去殼、去腸泥、切小塊的蝦子 一起放入剛才的豆腐糊裡 攪拌均勻將可以開始煎，也可加透抽、章魚、小珠貝、蟹肉\r\n5.開中小火、在鍋裡倒入一匙橄欖油預熱\r\n6.將大阪燒糊分成四等份，放入平底鍋中 稍微整形一下。接著蓋上鍋蓋計時4分鐘 翻面再煎2分鐘即可\r\n7.盛盤後 淋上低脂美乃滋和大阪燒醬 灑上海苔粉 最後放上柴魚片就完成了。', '原本大阪燒的主體是以低筋麵粉+高湯來製作，這次以雞蛋+嫩豆腐來取代，不只降低熱量、升醣值，也提升了蛋白質含量！口感一樣鬆軟好吃！適合正在減脂、不敢吃高GI澱粉的人', 'ae106a35333b963601030a32f1de31c5.jpg', 123456, 55, 29, '2022-06-01'),
(30, '10分鐘 迷迭香蒜蘑菇餃', 10, 2, '500', '西式料理', '餐廳廚師料理', '1.蘑菇  200克\r\n2.洋蔥  200克\r\n3.橄欖油  1大匙\r\n4.生蒜泥  1匙\r\n5.白酒  100ml\r\n6.高湯  350ml\r\n7.帕瑪森起司  30g\r\n8.義大利香料粉(可省略)  適量\r\n9.新鮮或乾燥迷迭香  適量\r\n10.玫瑰鹽  適量\r\n11.黑胡椒  適量\r\n12.水餃  24顆(8顆/份)', '1.將迷迭香加入雞高湯中，將湯煮沸，味道相融後過濾掉。\r\n2.鍋內放橄欖油、無鹽奶油、月桂葉，拌炒洋蔥至透明軟化狀。\r\n3.加入蘑菇拌炒。\r\n4.加生蒜泥拌炒，很快會飄出香味。\r\n5.再將高湯、清酒加入，加黑胡椒、鹽調味後熄火、移除月桂葉並拌入帕瑪森起司、一大匙無鹽奶油（份量外）。\r\n6.淋上已經煮熟的水餃，完成。', '只要花10分鐘就可以搞定的營養健康美食', '508ba85ad2e55a0d02fc8db292029879.jpg', 123456, 19, 26, '2022-06-01'),
(31, '香菇高麗菜飯', 15, 1, '400', '台式料理', '新手輕鬆入門', '1.香菇(泡水1.5杯)  4朵\r\n2.肉絲  1-2片\r\n3.米  2.5杯\r\n4.高麗菜  適量\r\n5.蒜  適量\r\n6.辣椒  1根\r\n7.櫻花蝦  5匙\r\n8.鹽  1匙\r\n9.醬油  2匙\r\n10.太白粉  1匙\r\n11.白胡椒  適量', '1.熱油4匙，加蒜、辣椒、櫻花蝦，炒香\r\n2.加高麗菜、香菇絲、香菇水、鹽2匙、醬油2匙，加蓋3分鐘，炒半軟\r\n3.加肉絲，拌炒變色，關火備用\r\n4.生米、水1杯，加炒料，開始炊飯', '簡易的家常料理，容易上手', '55a83f978b3f8e9c7b13528dbb863108.jpg', 123456, 44, 53, '2022-06-01'),
(32, '蒜香鹹蛋黃烤南瓜', 20, 3, '300', '西式料理', '新手輕鬆入門', '1.南瓜  600克\r\n2.鹹蛋黃  2顆\r\n3.橄欖油  1匙\r\n4.蒜末  10克\r\n5.胡椒粉  少許\r\n6.蔥花  少許', '1、南瓜去籽切塊，鹹蛋黃切碎\r\n2、南瓜放所有調味料，蒜末、鹹蛋黃，拌勻\r\n3、放入氣炸鍋，180度烤15分鐘，再撒點蔥花即可', '鮮甜可口的南瓜，裹上鹹香，口感沙沙的鹹蛋黃，營養飽腹，超級美味', '57817de4a830a813609ba21e0aa0613b.jpg', 123456, 43, 33, '2022-06-01'),
(33, '紅燒吳郭魚', 10, 4, '500', '台式料理', '新手輕鬆入門', '1.吳郭魚  1條\r\n2.蔥白  適量\r\n3.蔥綠  適量\r\n4.蒜頭  適量\r\n5.薑  4-5片\r\n6.米酒  2湯匙\r\n7.鹽  適量\r\n8.食用油  少許\r\n9.水  1米杯\r\n10.醬油  2.5湯匙', '1.蔥薑蒜先切好備用，蔥綠另外放，最後才下，蔥綠可以切段，也可以切絲，最後裝飾較美觀，醬汁先調好備用，米酒備用，最後起鍋前再加\r\n2.魚洗乾淨（內臟要清乾淨才不會有土味喔），接著擦乾多餘水份，在魚身上斜劃3-4刀，幫助入味，之後也好觀察魚肉有沒有熟，再來兩面均勻抹上鹽巴，稍微放置一下\r\n3.用不沾鍋，不用太多油熱鍋也不會沾黏魚皮，油熱後下魚煎至兩面金黃，中間有上蓋幫助快熟，一面中火煎約3-4分鐘，翻面的時候鏟子靠背鰭那面翻，魚較有支撐比較不會散掉。\r\n4.兩面金黃後，把魚移到邊邊騰出空間來，油集中到下面爆', '很家常的魚料理，考驗對食材的掌握度', 'b395572ac1fbc63429928c07e4c1415e.jpg', 123456, 73, 45, '2022-06-01'),
(34, '簡易版牛肉羅宋湯', 90, 3, '500', '日式料理', '米其林名廚作品', '1..牛肋條  3條\r\n2.義式番茄糊  1/2罐\r\n3.馬鈴薯（小顆）  2顆\r\n4.紅蘿蔔  1/3條\r\n5.洋蔥  適量\r\n6.西洋芹  1根\r\n7.高麗菜  1/4顆\r\n8.即食雞湯  1罐', '1.牛肋條切小塊，鍋子不加油燒熱，直接煎牛肋條塊，可以先加入一些海鹽、黑胡椒調味。\r\n2.用煸出的牛油一起拌炒紅蘿蔔跟洋蔥\r\n3.即食雞高湯加熱，將炒過的牛肉、蔬菜倒入鍋中，加入義式番茄糊\r\n4.中小火先燉煮40分鐘\r\n5.燉煮40分鐘後，水份會少一點（但不致於會燒到鍋子乾掉），加入馬鈴薯（切中小丁）再煮15分鐘\r\n6.40分鐘+15分鐘，可以試吃一下牛肉的軟爛程度和味道，即可上桌', '擁有豐富茄紅素的湯品料理', 'ef2cae0b21276b63b6be9a6b3a23e509.jpg', 123456, 49, 29, '2022-06-01'),
(35, '香辣干貝醬佐杏鮑菇', 20, 3, '200', '台式料理', '餐廳廚師料理', '1.豬絞肉  約300克\r\n2.杏鮑菇  2根\r\n3.蒜頭  2瓣\r\n4.干貝海鮮醬-小辣  2大匙\r\n5.水  3/1碗\r\n6.糖  適量\r\n7.白胡椒粉  1小匙\r\n8.米酒  2大匙', '1.先將豬絞肉撒一些白胡椒粉&加上約2湯匙的米酒捏捏放置備料約15分鐘（前置作業）\r\n2.蒜頭切末\r\n3.熱鍋熱油後，蒜末爆香金黃表面，再下豬絞肉拌炒約3分\r\n4.加入2湯匙干貝醬及杏鮑菇後加入約1/3碗水及砂糖調味，翻炒5～6分鐘熟後 即可起鍋', '又香又辣的白飯殺手料理', '7dbcfd8937745e5dbc8a191394920561.jpg', 123456, 67, 55, '2022-06-01'),
(36, '肉捲飯糰', 60, 2, '500', '日式料理', '餐廳廚師料理', '1.白芝麻粒  適量\r\n2.豬梅花肉片  2盒\r\n3.鹽  適量\r\n4.醬油  2匙\r\n5.味霖  2匙\r\n6.米酒  2匙\r\n7.細砂糖  1匙\r\n8.壽司米  2米杯\r\n9.水  2.4米杯\r\n10.油  少許\r\n11.香鬆  適量', '1. 煮飯（比例壽司米1：水1.2）\r\n2. 待電鍋跳起微悶後用飯匙鬆飯，靜置微涼後加入香鬆攪拌均勻備用\r\n3.取一碗調製醬料， 豬梅花肉片灑上適量的鹽醃製15分鐘， 戴上手套將飯捏成圓形狀（可製作成9顆）\r\n4.取一保鮮膜，將肉片平鋪後放上飯糰捲起，再鋪上一片肉片另一邊開口處再捲起（每個飯糰使用2片肉片包）\r\n5.捲好的飯糰上均勻撒上適量太白粉，平底鍋加上適量油小火即可放入飯糰將每面煎至焦香\r\n6.加入半米杯水蓋上鍋蓋悶5分鐘至肉片熟透，加入照燒醬汁讓飯糰每面都沾裹到醬汁到收汁\r\n7. 盛盤飯糰上撒上適', '裹上照燒醬汁的肉捲飯糰', 'bee12560c33037987b6e0c767ef83f5f.jpg', 123456, 65, 31, '2022-06-01'),
(37, '泰式檸檬魚', 20, 4, '500', '東南亞料理', '餐廳廚師料理', '1.鱸魚  半隻\r\n2.檸檬  一顆\r\n3.老薑  5篇\r\n4.蒜頭  8顆\r\n5.辣椒  1條\r\n6.洋蔥  半顆\r\n7.米酒  3大湯匙\r\n8.糖  一大湯匙\r\n9.魚露  3大湯匙', '1.洋蔥、蒜頭、辣椒切丁，檸檬切3片備用，其他擠汁\r\n2.鱸魚放入盤中，加米酒、薑片、蔥段放入電鍋蒸\r\n3.放入三片檸檬、蔥段再悶2分鐘\r\n4.洋蔥、蒜頭、辣椒打碎，並加入魚露\r\n5.調整一下擺盤，淋上醬料即完成', '炎炎夏日開胃的一道好料理', 'dd0d41a6e1b248b174171ad1738129c3.jpg', 123456, 16, 33, '2022-06-01'),
(38, '味噌湯', 10, 5, '300', '日式料理', '新手輕鬆入門', '1.味噌1小包  140公克\r\n2.洋蔥  半顆\r\n3.嫩豆腐  1盒\r\n4.水  1000cc\r\n5.奶粉  20公克\r\n6.砂糖  10公克\r\n7.柴魚片  少許(可不加)', '1.洋蔥半顆切絲\r\n2.嫩豆腐一盒切塊狀(大小依自己喜好)\r\n3.開大火，將1000cc的水先預熱，水煮熱之後，撈一些水起來先將味噌跟奶粉攪散\r\n4.水開始小滾(冒泡泡)之後，就可以下洋蔥絲，等水再次小滾，就下豆腐\r\n5.靜置1分鐘，再將攪好的味噌跟奶粉下鍋\r\n6.味噌下之後，蓋上鍋蓋直到再次小滾\r\n7.味噌澱粉含量高，如果大滾會整個冒出來，所以小滾就可以先將鍋蓋打開，開蓋之後轉小火，並將砂糖及柴魚下鍋，輕輕地拌勻\r\n9.等到湯滾了，就可以起鍋', '煮起來不會死鹹又甘甜的湯', '0e9b7457b20d44981c93b8f190e80150.jpg', 123456, 28, 37, '2022-06-01'),
(39, '鮮蚵嫩豆腐', 10, 3, '400', '台式料理', '新手輕鬆入門', '1.鮮蚵  半斤\r\n2.豆腐  一盒\r\n3.豆瓣醬  兩匙\r\n4.醬油  一匙\r\n5.香油  一匙\r\n6.米酒  一匙\r\n7.洋蔥  1/5\r\n8.蒜頭  4瓣\r\n9.辣椒  一根\r\n10.蔥  少許\r\n11.香菜  兩片', '1.熱鍋放油，辣椒/洋蔥/蔥花爆香\r\n2.倒入切好的嫩豆腐\r\n3.加入米酒/醬油/豆瓣醬，拿鏟子稍微推一下小心弄破豆腐\r\n4.加入鮮蚵\r\n5.等到收汁加點香油就可以起鍋\r\n6.加入香菜點綴', '搭配嫩豆腐根本是白飯殺手，煮起來又很簡單上手', '07e11f51f9d409804bafa4a34e937bac.jpg', 123456, 72, 86, '2022-06-01'),
(40, '沙嗲烤雞肉串', 45, 3, '600', '東南亞料理', '餐廳廚師料理', '1.雞肉  600克\r\n2.沙嗲醬  1小匙\r\n3.醬油  1小匙\r\n4.糖  1小匙\r\n5.香油  1大匙\r\n6.白胡椒粉  少許\r\n6.奶油  25克\r\n7.蒜末  1小匙\r\n8.沙嗲醬  1大匙\r\n9.花生醬  2小匙\r\n10.豆瓣醬（可省略）  1小匙\r\n11.糖  1大匙\r\n12.水  120毫升\r\n13.椰漿  120毫升', '1.將雞肉切小塊，然後用醃料醃雞肉最少一個小時\r\n2.將竹籤浸在熱水5分鐘，這可防止在烤時竹籤變黑。然將雞肉串起\r\n3.將雞肉串放在鋪有鋁箔紙的烤盤上，放入已預熱180度烤箱，烤約15 -18分鐘，烤至一半時間時，將雞肉翻面再烤（可在雞肉上塗少許油）\r\n4.沙嗲沾醬做法：將奶油放在鍋內，煮至溶化，然後下蒜末\r\n5.再下所有沾醬材料拌勻（除了椰漿），煮至醬汁濃稠後，再加椰漿煮沸即可完成', '充滿東南亞風味的沙嗲烤雞串', 'ffecb64e499a7cce7222fcb03ea9d208.jpg', 123456, 41, 48, '2022-06-01');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `recipe`
--
ALTER TABLE `recipe`
  ADD PRIMARY KEY (`recipes_sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `recipe`
--
ALTER TABLE `recipe`
  MODIFY `recipes_sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
